spoemb/linkit-v4-core/ports/nrf52840/core/hardware/smd_sat/smd_sat.cpp
	// Release RESET — STM32WL boots
	GPIOPins::release_to_highz(SAT_RESET);
	PMU::kick_watchdog();
	nrf_delay_ms(smdsat_delay_power_on_ms());

	// Init SPI AFTER boot (avoid MISO backfeed during power ramp)
	m_cmd.init();

	// Wait for STM32WL to respond
	bool ready = false;
	for (uint8_t attempt = 0; attempt < 10; attempt++) {
		PMU::kick_watchdog();
		nrf_delay_ms(smdsat_delay_power_on_ms() / 2);
		if (m_cmd.ping()) {
			ready = true;
			break;
		}
	}

	// VPA stays LOW until TX — released in state_transmit_pending, driven LOW again after TX
	if (!ready) {
		DEBUG_ERROR("SmdSat::%s: SMD did not respond after boot", __func__);
	}
}

void SmdSat::power_off() {
	DEBUG_TRACE("SmdSat::%s",__func__);
	if (!SMD_STATE_EQUAL(stopped)) {
		m_stopping = true;
	}
}

void SmdSat::power_on() {
	DEBUG_TRACE("SmdSat::%s",__func__);

#if SMDSAT_AUTOFALLBACK_ENABLED
	// First power_on after boot: restore persisted SAFE/FAST choice from
	// config_store so a watchdog reset in degraded mode keeps the SAFE
	// timings on the next session.
	degraded_mode_load_if_needed();
#endif

	if (m_state != SmdSat::stopped) {
		m_stopping = false;
		TXTRACE("power_on(): already running (state=%d) — TX rides existing session",
		        static_cast<int>(m_state));
		return;
	}

	m_stopping = false;
	TXTRACE("power_on(): cold start, entering state machine");
	SMD_STATE_CHANGE(stopped, starting);
	state_machine();
}


void SmdSat::power_off_immediate()
{
	DEBUG_TRACE("SmdSat::%s",__func__);

	if (!SMD_STATE_EQUAL(stopped)) {
#if SMDSAT_AUTOFALLBACK_ENABLED
		// Detect TX cascade pattern BEFORE we overwrite m_state. If state was
		// transmitting and we burned through >25% of the polling budget without
		// success, the dive (or other external cancellation) just masked an
		// SPI-cascade failure that would have hit state_error timeout — count
		// it toward the autofallback so flapping devices don't slip through.
		degraded_mode_note_tx_cancelled_during_cascade();
#endif
		system_scheduler->cancel_task(m_task);
		switch (m_state) {
		case SmdSatState::starting:         state_starting_exit(); break;
		case SmdSatState::powering_on:      state_powering_on_exit(); break;
		case SmdSatState::load_kmac:        state_load_kmac_exit(); break;
		case SmdSatState::idle_pending:     state_idle_pending_exit(); break;
		case SmdSatState::idle:             state_idle_exit(); break;
		case SmdSatState::transmit_pending: state_transmit_pending_exit(); break;
		case SmdSatState::transmitting:     state_transmitting_exit(); break;
		case SmdSatState::error:            state_error_exit(); break;
		case SmdSatState::stopped:          break;
		default: break;
		}
		m_state = SmdSatState::stopped;
		state_stopped_enter();
	}

	// Clean up transport in case state was already stopped
	m_cmd.deinit();
}

// ============================================================================
// State machine
// ============================================================================

void SmdSat::state_machine(bool use_scheduler) {
	m_next_delay = 0;

	switch (m_state) {
	case SmdSat::starting:
		SMD_STATE_CALL(starting);
		break;
	case SmdSat::powering_on:
		SMD_STATE_CALL(powering_on);
		break;
	case SmdSat::load_kmac:
		SMD_STATE_CALL(load_kmac);
		break;
	case SmdSat::idle_pending:
		SMD_STATE_CALL(idle_pending);
		break;
	case SmdSat::idle:
		SMD_STATE_CALL(idle);
		break;
	case SmdSat::transmit_pending:
		SMD_STATE_CALL(transmit_pending);
		break;
	case SmdSat::transmitting:
		SMD_STATE_CALL(transmitting);
		break;
	case SmdSat::error:
		SMD_STATE_CALL(error);
		break;
	case SmdSat::stopped:
		SMD_STATE_CALL(stopped);
		break;
	default:
		break;
	}

	if (use_scheduler && !SMD_STATE_EQUAL(stopped)) {
		if (m_next_delay > 100) {
			TXTRACE("state_machine: rescheduling tick in %u ms (state=%d)",
			        m_next_delay, static_cast<int>(m_state));
		}
		system_scheduler->cancel_task(m_task);
		m_task = system_scheduler->post_task_prio([this]() {
			state_machine();
		}, "SmdReceiverStateMachine", SMD_SCHEDULER_PRIORITY, m_next_delay);
	}
}

void SmdSat::state_starting_enter() {}
void SmdSat::state_starting_exit() {}

void SmdSat::state_starting()
{
	m_is_first_tx = true;
	is_kmac_profil_loaded = false;  // Force entry to state_load_kmac for boot config (TCXO, LPM)
	// m_needs_explicit_kmac_load is NOT reset here — it persists across power cycles.
	// Only set true when RCONF/credentials actually change (steps 1a/1b in load_kmac).
	// When false, STM32 auto-initializes MAC from flash at POR — no SPI command needed.
	m_credentials_written = false;
	m_rconf_recovery_attempted = false;
	// SPI init is deferred to state_idle_pending (after power-on + reset release).
	// Initializing SPI here would configure MISO as input without pulldown while
	// the STM32WL is booting — risk of MISO backfeed via nRF ESD diode.
	m_state_counter = 3;
	m_next_delay = 0;
	SMD_STATE_CHANGE(starting, powering_on);
}

void SmdSat::state_error_enter() {
	// Force KMAC reload on next boot — SMD may be in inconsistent state.
	// Do NOT attempt SPI commands here — the bus is likely desynchronized
	// (INVALID_CMD cascade). Any command would fail and waste time.
	is_kmac_profil_loaded = false;
	m_error_count++;

	if (m_error_count >= SMD_MAX_CONSECUTIVE_ERRORS) {
		// Too many consecutive errors — enter 30 min cooldown to stop SPI spam
		// and save battery.  SMD will be retried after cooldown expires.
		m_cooldown_until = PMU::get_timestamp_ms() + SMD_ERROR_COOLDOWN_MS;
		DEBUG_ERROR("SmdSat: %u consecutive errors — cooldown for %u min",
			m_error_count, SMD_ERROR_COOLDOWN_MS / 60000);
		VAL_SAT("cooldown_engaged reason=state_error duration_min=%u",
		        SMD_ERROR_COOLDOWN_MS / 60000);
		m_error_count = 0;  // Reset for next attempt after cooldown
#if SMDSAT_AUTOFALLBACK_ENABLED
		// Autofallback: engage SAFE timings (or double the trust window if
		// we were already in SAFE and a FAST retest just failed).
		degraded_mode_engage();
#endif
	}

	notify(KineisEventDeviceError({}));
	SMD_STATE_CHANGE(error, stopped);
}

