spoemb/linkit-v4-core/ports/nrf52840/core/hardware/smd_sat/smd_sat.cpp
void SmdSat::state_idle_pending_exit() {
	m_next_delay = SMDSAT_DELAY_STATE_TICK_MS;
}

void SmdSat::state_idle_pending() {
	TXTRACE("state_idle_pending: tick entered, calling ping() now");
	// Capture t0 AFTER the log above so the LFS commit time isn't counted in ping_ms.
	[[maybe_unused]] uint64_t ping_t0 = PMU::get_timestamp_ms();
	bool ping_ok = m_cmd.ping();
	[[maybe_unused]] unsigned int ping_ms = static_cast<unsigned>(PMU::get_timestamp_ms() - ping_t0);
	TXTRACE("state_idle_pending: ping() returned %s after %u ms",
	        ping_ok ? "OK" : "FAIL", ping_ms);
	if (ping_ok) {
		TXTRACE("state_idle_pending: ping OK (retries_left=%u) -> %s",
		        m_state_counter, is_kmac_profil_loaded ? "idle" : "load_kmac");
		// Small delay after ping ACK for STM32 DMA re-arm.
		// MAC readiness is verified in state_load_kmac (poll MAC_OK).
		nrf_delay_ms(10);
		// VPA stays LOW — only released just before TX (state_transmit_pending)
		if (!is_kmac_profil_loaded) {
			SMD_STATE_CHANGE(idle_pending, load_kmac);
		} else {
			SMD_STATE_CHANGE(idle_pending, idle);
		}
		return;
	}
	if (--m_state_counter == 0) {
		DEBUG_ERROR("SmdSat::%s: failed to enter IDLE state",__func__);
		SMD_STATE_CHANGE(idle_pending, error);
	} else {
		TXTRACE("state_idle_pending: ping FAIL, retry in %u ms (counter=%u)",
		        SMDSAT_DELAY_STATE_TICK_MS, m_state_counter);
		m_next_delay = SMDSAT_DELAY_STATE_TICK_MS;
	}
}

void SmdSat::state_idle_enter() {
	m_next_delay = SMDSAT_DELAY_TICK_INTERRUPT_MS;
	// Clamp ≥1: integer division of m_idle_timeout_ms / TICK_MS gives 0 when
	// idle_timeout < TICK_MS (10 ms). 0 then underflows on the first
	// --m_state_counter to UINT_MAX → idle effectively never times out, so
	// state_idle keeps re-scheduling until something external (packet arrival
	// or m_stopping) breaks the loop. Real callers pass 1 s default or
	// 35 s burst, so this is defense-in-depth against a future caller
	// passing a small or zero value.
	m_state_counter = m_idle_timeout_ms / SMDSAT_DELAY_TICK_INTERRUPT_MS;
	if (m_state_counter == 0) m_state_counter = 1;

	// If LPM allows STANDBY/SHUTDOWN, release wakeup pin LOW so SMD can
	// enter deep sleep while waiting for next TX in this session.
	//
	// IMPORTANT: in the normal send() path, m_packet_buffer is filled BEFORE
	// power_on() is called, so state_idle is transient (1 tick) — we go
	// straight to transmit_pending. Dropping WKUP here would let the STM32
	// start entering STANDBY, and raising it 10 ms later triggers a POR wake
	// (reset + firmware re-init ~100-200 ms) while we send SPI TX REQ
	// immediately → TX REQ fails. So only drop WKUP if the buffer is empty,
	// i.e. a real idle period (warm_up_for_tx-style pre-boot).
#ifdef SAT_EXTWAKEUP
	m_wkup_lowered = false;
	if ((m_lpm_mode & 0x18) && !m_packet_buffer.length()) {
		GPIOPins::clear(SAT_EXTWAKEUP);
		m_wkup_lowered = true;
		DEBUG_TRACE("SmdSat::%s: WKUP LOW (LPM=0x%02X, idle lingering)", __func__, m_lpm_mode);
	}
#endif
}

void SmdSat::state_idle_exit() {
	// Only raise WKUP + wait if we actually lowered it in state_idle_enter.
	// Avoids a pointless 50 ms delay (and spurious wake-up POR) in the
	// common transient-idle case where WKUP was never dropped.
#ifdef SAT_EXTWAKEUP
	if (m_wkup_lowered) {
		GPIOPins::set(SAT_EXTWAKEUP);
		nrf_delay_ms(50);  // STM32 wakeup from STANDBY/SHUTDOWN takes ~50ms (STANDBY).
		                   // SHUTDOWN needs more — user should not enable 0x10 without
		                   // also increasing this and re-running state_load_kmac (TCXO/LPM
		                   // are RAM registers lost on SHUTDOWN wake = full POR).
		m_wkup_lowered = false;
		DEBUG_TRACE("SmdSat::%s: WKUP HIGH (wakeup from LPM)", __func__);
	}
#endif
	m_next_delay = SMDSAT_DELAY_STATE_TICK_MS;
}

void SmdSat::state_idle() {
	if (m_packet_buffer.length()) {
		TXTRACE("state_idle: packet pending -> transmit_pending");
		m_tx_buffer = m_packet_buffer;
		m_packet_buffer.clear();
		SMD_STATE_CHANGE(idle, transmit_pending);
	} else if (m_stopping) {
		SMD_STATE_CHANGE(idle, stopped);
	} else {
		m_next_delay = SMDSAT_DELAY_TICK_INTERRUPT_MS;
		if (--m_state_counter == 0) {
			DEBUG_TRACE("SmdSat::%s: idle timeout elapsed",__func__);
			SMD_STATE_CHANGE(idle, stopped);
		}
		return;
	}

	// Mirror the clamp from state_idle_enter — same UINT_MAX underflow risk
	// when transitioning back to idle from a TX with a small idle_timeout.
	m_state_counter = m_idle_timeout_ms / SMDSAT_DELAY_TICK_INTERRUPT_MS;
	if (m_state_counter == 0) m_state_counter = 1;
}

void SmdSat::state_transmit_pending_enter() {
	m_state_counter = 3;
}

void SmdSat::state_transmit_pending_exit() {
	// First TX after power-on: warmup forced to 0 ONLY if the die is warm enough.
	// Cold die (deep cold dive then quick surface) keeps the configured warmup
	// to avoid an off-frequency first TX. Must match the gate logic in
	// state_load_kmac so the SMD's actual warmup matches our poll horizon.
	bool tcxo_skip = m_is_first_tx && (PMU::get_die_temperature_c() >= TCXO_SKIP_TEMP_THRESHOLD_C);
	unsigned int effective_warmup = tcxo_skip ? 0 : m_tcxo_warmup_time;
	unsigned int base_delay = (effective_warmup > 0) ? SMDSAT_DELAY_CMD_TX : smdsat_first_tx_base_delay_ms();
	m_next_delay = base_delay + (effective_warmup * 1000);
	TXTRACE("state_transmit_pending_exit: scheduling 1st TX poll in %u ms (first_tx=%u warmup=%u s)",
	        m_next_delay, m_is_first_tx, effective_warmup);
}

// Keep every retransmission of one logical message on the same Argos MAC message
// counter (MC). The SMD auto-increments MC after each TX, so without this each
// repeat of the same payload would carry a different MC. Policy (ALL modes —
// LEGACY / pass-prediction / duty-cycle / doppler / surface-doppler — because
// this is the single choke point for every SMD TX):
//   - NEW message (payload differs from the previous TX): do NOT touch the MC.
//     No SPI op is issued, so the first-TX timing is preserved (critical for
//     surface-doppler). The message goes out with the SMD's natural MC.
//   - REPEAT (identical payload): decrement MC by 1 (mod 512) so this copy is
//     transmitted with the same counter as the previous identical copy. Every
//     repeat lands back on that first MC.
// Optional / graceful: if the module firmware lacks the MC command, the read or
// write returns false, we latch "unsupported" and leave the SMD to auto-manage
// its MC — nothing else changes.
void SmdSat::apply_message_counter_hold()
{
	if (m_mc_support == McSupport::NO)
		return;  // module lacks the MC command — leave the SMD's MC auto-managed

	const bool is_repeat = !m_mc_last_payload.empty() &&
	                       (m_tx_buffer == m_mc_last_payload);

	if (!is_repeat) {
		// New message — leave the MC untouched (no SPI op → first-TX timing
		// preserved). Just remember the payload to detect future repeats.
		m_mc_last_payload = m_tx_buffer;
		return;
	}

	// Repeat of the same message — decrement the MC by 1 (mod 512) so this copy
	// reuses the counter of the previous identical transmission.
	uint16_t cur = 0;
	if (!m_cmd.read_message_counter(&cur)) {
		DEBUG_INFO("SmdSat::%s: read MC unsupported — MC hold disabled (SMD auto-manages MC)", __func__);
		m_mc_support = McSupport::NO;
		return;
	}
	uint16_t dec = (cur == 0) ? 511 : static_cast<uint16_t>(cur - 1);
	if (m_cmd.set_message_counter(dec)) {
		m_mc_support = McSupport::YES;
		DEBUG_TRACE("SmdSat::%s: repeat — MC %u -> %u (held)", __func__, cur, dec);
	} else {
		DEBUG_INFO("SmdSat::%s: set MC unsupported — MC hold disabled", __func__);
		m_mc_support = McSupport::NO;
	}
}

