spoemb/linkit-v4-core/ports/nrf52840/core/hardware/smd_sat/smd_sat.cpp
	nrf_delay_ms(120);  // Flash persistence (~100ms) + margin

	// 3. Reload KMAC profile 1
	try {
		m_cmd.load_kmac_profil(1);
	} catch (...) {
		DEBUG_ERROR("SmdSat::%s: failed to reload KMAC", __func__);
		return false;
	}
	MODSWITCH_LOG(modswitch_elapsed(), "load_kmac_profil(1) OK, waiting 200ms");

	nrf_delay_ms(200);  // MAC re-init after KMAC reload

	// Update cached modulation
	m_modulation = target;
	is_kmac_profil_loaded = true;
	// Persist so the next boot loads this modulation directly.
	if (configuration_store) {
		configuration_store->write_param(ParamID::ARGOS_CACHED_MODULATION,
		                                 static_cast<unsigned int>(m_modulation));
	}

	MODSWITCH_LOG(modswitch_elapsed(), "modulation switched to %d OK — TOTAL",
	              static_cast<int>(target));
	return true;
}

KineisModulation SmdSat::get_current_modulation() const {
	return smd_to_kineis_mod(m_modulation);
}

// ============================================================================
// DFU (delegates to command layer)
// ============================================================================

bool SmdSat::dfu_enter() {
	DEBUG_TRACE("SmdSat::%s", __func__);

	bool was_stopped = (m_state == SmdSatState::stopped);

	if (was_stopped) {
		GPIOPins::acquire_sensors_pwr();
		GPIOPins::set(SAT_PWR_EN);
		PMU::kick_watchdog();
		nrf_delay_ms(smdsat_delay_power_on_ms());
		PMU::kick_watchdog();
		nrf_delay_ms(smdsat_delay_power_on_ms());
#ifdef SMD_VPA_PIN
		GPIOPins::release_to_highz(SMD_VPA_PIN);
#endif

		// Only init SPI if it wasn't already running
		m_cmd.init();
	}
	// If SPI is already active (not stopped), do NOT re-init — dfu_enter() handles protocol reset

	PMU::kick_watchdog();
	nrf_delay_ms(smdsat_delay_power_on_ms() / 2);

	bool result = m_cmd.dfu_enter();

	if (!result) {
		if (was_stopped) {
			m_cmd.deinit();
			shutdown();
			GPIOPins::release_sensors_pwr();
			nrf_gpio_cfg_default(BSP::GPIO_Inits[SAT_RESET].pin_number);
		}
	}

	return result;
}

bool SmdSat::dfu_exit() {
	return m_cmd.dfu_exit();
}

bool SmdSat::dfu_get_bootloader_info(SmdDfuInfo *info) {
	return m_cmd.dfu_get_bootloader_info(info);
}

SmdDfuResponse SmdSat::firmware_update(const uint8_t *firmware, size_t size,
                                       void (*progress_callback)(uint8_t percent)) {
	DEBUG_INFO("SmdSat::%s: Starting firmware update | size=%u bytes", __func__, static_cast<unsigned>(size));

	if (firmware == nullptr || size == 0) {
		DEBUG_ERROR("SmdSat::%s: Invalid firmware data", __func__);
		return DFU_RSP_ERROR;
	}

	SmdDfuResponse result;

	if (!m_cmd.dfu_supported()) {
		DEBUG_ERROR("SmdSat::%s: DFU not supported by command layer", __func__);
		return DFU_RSP_ERROR;
	}

	// DFU failure cleanup: exit DFU mode so SMD returns to normal operation
	auto dfu_fail = [this](SmdDfuResponse r) -> SmdDfuResponse {
		m_cmd.dfu_exit();
		return r;
	};

	// Enter DFU mode
	if (!dfu_enter()) {
		DEBUG_ERROR("SmdSat::%s: Failed to enter DFU mode", __func__);
		return DFU_RSP_NOT_READY;
	}

	if (progress_callback) progress_callback(5);

	// Get bootloader info
	SmdDfuInfo dfu_info;
	if (!m_cmd.dfu_get_bootloader_info(&dfu_info)) {
		DEBUG_ERROR("SmdSat::%s: Failed to get bootloader info", __func__);
		return dfu_fail(DFU_RSP_ERROR);
	}

	if (size > dfu_info.app_max_size) {
		DEBUG_ERROR("SmdSat::%s: Firmware too large (%u > %u)", __func__,
		            static_cast<unsigned>(size), dfu_info.app_max_size);
		return dfu_fail(DFU_RSP_SIZE_ERROR);
	}

	if (progress_callback) progress_callback(15);

	// Erase
	result = m_cmd.dfu_erase();
	if (result != DFU_RSP_OK) {
		DEBUG_ERROR("SmdSat::%s: Flash erase failed", __func__);
		return dfu_fail(result);
	}

	if (progress_callback) progress_callback(25);

	// Write in chunks
	uint32_t addr = dfu_info.app_start_addr;
	size_t remaining = size;
	size_t offset = 0;
	uint8_t last_progress = 25;

	while (remaining > 0) {
		uint16_t chunk_size = (remaining > SMDSAT_DFU_CHUNK_SIZE) ?
		                      SMDSAT_DFU_CHUNK_SIZE : static_cast<uint16_t>(remaining);

		PMU::kick_watchdog();

		result = m_cmd.dfu_write_chunk(addr, &firmware[offset], chunk_size);
		if (result != DFU_RSP_OK) {
			DEBUG_ERROR("SmdSat::%s: Write failed at offset %u", __func__, static_cast<unsigned>(offset));
			return dfu_fail(result);
		}

		addr += chunk_size;
		offset += chunk_size;
		remaining -= chunk_size;

		if (progress_callback) {
			uint8_t progress = 25 + static_cast<uint8_t>((offset * 60) / size);
			if (progress > last_progress) {
				progress_callback(progress);
				last_progress = progress;
			}
		}

		nrf_delay_ms(5);
	}

	if (progress_callback) progress_callback(90);

	// Verify CRC32
	PMU::kick_watchdog();
	uint32_t crc = m_cmd.calculate_crc32(firmware, size);
	result = m_cmd.dfu_verify(crc);
	if (result != DFU_RSP_OK) {
		DEBUG_ERROR("SmdSat::%s: CRC verification failed", __func__);
		return dfu_fail(result);
	}

	if (progress_callback) progress_callback(95);

	// Jump to application
	m_cmd.dfu_jump();

	// Full power cycle — GPIO reset alone won't clear SRAM DFU magic
	DEBUG_INFO("SmdSat::%s: Power cycling SMD for clean app boot...", __func__);
	m_cmd.deinit();
	shutdown();
	PMU::kick_watchdog();
	nrf_delay_ms(500);
	PMU::kick_watchdog();

	power_on_blocking();

	m_new_firmware_version = get_firmware_version();
	if (!m_new_firmware_version.empty()) {
		DEBUG_INFO("SmdSat::%s: New firmware: %s", __func__, m_new_firmware_version.c_str());
	} else {
		DEBUG_WARN("SmdSat::%s: App not responding after power cycle", __func__);
	}

	if (progress_callback) progress_callback(100);

	DEBUG_INFO("SmdSat::%s: Firmware update completed!", __func__);
	return DFU_RSP_OK;
}

SmdDfuResponse SmdSat::firmware_update(File *file, size_t size, uint32_t stm32_crc32,
                                       void (*progress_callback)(uint8_t percent)) {
	DEBUG_INFO("SmdSat::%s: Starting streamed firmware update | size=%u bytes | CRC32=0x%08X",
	           __func__, static_cast<unsigned>(size), stm32_crc32);

