spoemb/linkit-v4-core/ports/nrf52840/core/hardware/smd_sat/smd_sat.cpp
	if (file == nullptr || size == 0) {
		return DFU_RSP_ERROR;
	}

	if (!m_cmd.dfu_supported()) {
		return DFU_RSP_ERROR;
	}

	SmdDfuResponse result;

	// DFU failure cleanup: exit DFU mode so SMD returns to normal operation
	auto dfu_fail = [this](SmdDfuResponse r) -> SmdDfuResponse {
		m_cmd.dfu_exit();
		return r;
	};

	if (!dfu_enter()) {
		return DFU_RSP_NOT_READY;
	}

	if (progress_callback) progress_callback(5);

	SmdDfuInfo dfu_info;
	if (!m_cmd.dfu_get_bootloader_info(&dfu_info)) {
		return dfu_fail(DFU_RSP_ERROR);
	}

	if (size > dfu_info.app_max_size) {
		return dfu_fail(DFU_RSP_SIZE_ERROR);
	}

	if (progress_callback) progress_callback(15);

	result = m_cmd.dfu_erase();
	if (result != DFU_RSP_OK) return dfu_fail(result);

	if (progress_callback) progress_callback(25);

	uint32_t addr = dfu_info.app_start_addr;
	size_t remaining = size;
	size_t offset = 0;
	uint8_t last_progress = 25;
	uint8_t chunk_buf[SMDSAT_DFU_CHUNK_SIZE];

	while (remaining > 0) {
		uint16_t chunk_size = (remaining > SMDSAT_DFU_CHUNK_SIZE) ?
		                      SMDSAT_DFU_CHUNK_SIZE : static_cast<uint16_t>(remaining);

		PMU::kick_watchdog();

		lfs_ssize_t bytes_read = file->read(chunk_buf, chunk_size);
		if (bytes_read != static_cast<lfs_ssize_t>(chunk_size)) {
			return dfu_fail(DFU_RSP_ERROR);
		}

		result = m_cmd.dfu_write_chunk(addr, chunk_buf, chunk_size);
		if (result != DFU_RSP_OK) return dfu_fail(result);

		addr += chunk_size;
		offset += chunk_size;
		remaining -= chunk_size;

		if (progress_callback) {
			uint8_t progress = 25 + static_cast<uint8_t>((offset * 60) / size);
			if (progress > last_progress) {
				progress_callback(progress);
				last_progress = progress;
			}
		}

		nrf_delay_ms(5);
	}

	if (progress_callback) progress_callback(90);

	result = m_cmd.dfu_verify(stm32_crc32);
	if (result != DFU_RSP_OK) return dfu_fail(result);

	if (progress_callback) progress_callback(95);

	m_cmd.dfu_jump();

	// Full power cycle after JUMP to ensure clean app boot.
	// A GPIO reset alone would NOT clear SRAM, so the DFU magic (0x4446554D)
	// at 0x2000FFF8 would survive and cause the bootloader to re-enter DFU.
	// Power cycle cuts VCC → SRAM is lost → clean boot into new app.
	DEBUG_INFO("SmdSat::%s: Power cycling SMD for clean app boot...", __func__);
	m_cmd.deinit();
	shutdown();  // SAT_PWR_EN OFF + SAT_RESET LOW
	PMU::kick_watchdog();
	nrf_delay_ms(500);  // Capacitors discharge, SRAM loses state
	PMU::kick_watchdog();

	power_on_blocking();

	m_new_firmware_version = get_firmware_version();
	if (!m_new_firmware_version.empty()) {
		DEBUG_INFO("SmdSat::%s: New firmware: %s", __func__, m_new_firmware_version.c_str());
	} else {
		DEBUG_WARN("SmdSat::%s: App not responding after power cycle", __func__);
	}

	if (progress_callback) progress_callback(100);
	return DFU_RSP_OK;
}

SmdDfuResponse SmdSat::firmware_update_from_file(const std::string& filepath,
                                                 void (*progress_callback)(uint8_t percent)) {
	(void)filepath;
	(void)progress_callback;
	DEBUG_ERROR("SmdSat::%s: Not implemented", __func__);
	return DFU_RSP_ERROR;
}

bool SmdSat::cw_start(uint32_t freq_hz, uint16_t power_dbm, uint16_t duration_s) {
	DEBUG_INFO("SmdSat::cw_start: %lu Hz, %u dBm, %u s",
	           (unsigned long)freq_hz, power_dbm, duration_s);

	bool was_stopped = (m_state == SmdSatState::stopped);
	if (was_stopped) {
		power_on_blocking();
	}

	uint8_t payload[9];
	payload[0] = 0x01;  // mode = start
	payload[1] = static_cast<uint8_t>(freq_hz & 0xFF);
	payload[2] = static_cast<uint8_t>((freq_hz >> 8) & 0xFF);
	payload[3] = static_cast<uint8_t>((freq_hz >> 16) & 0xFF);
	payload[4] = static_cast<uint8_t>((freq_hz >> 24) & 0xFF);
	payload[5] = static_cast<uint8_t>(power_dbm & 0xFF);
	payload[6] = static_cast<uint8_t>((power_dbm >> 8) & 0xFF);
	size_t len = 7;
	if (duration_s > 0) {
		payload[7] = static_cast<uint8_t>(duration_s & 0xFF);
		payload[8] = static_cast<uint8_t>((duration_s >> 8) & 0xFF);
		len = 9;
	}

	try {
		m_cmd.write_cw(payload, static_cast<uint16_t>(len));
		return true;
	} catch (...) {
		DEBUG_ERROR("SmdSat::cw_start: write_cw threw");
		return false;
	}
}

bool SmdSat::cw_stop() {
	DEBUG_INFO("SmdSat::cw_stop");
	if (m_state == SmdSatState::stopped) return true;

	uint8_t payload[7] = { 0x00, 0, 0, 0, 0, 0, 0 };  // mode = stop
	try {
		m_cmd.write_cw(payload, sizeof(payload));
		return true;
	} catch (...) {
		DEBUG_ERROR("SmdSat::cw_stop: write_cw threw");
		return false;
	}
}

std::string SmdSat::get_firmware_version() {
	DEBUG_TRACE("SmdSat::%s", __func__);

	bool was_stopped = (m_state == SmdSatState::stopped);

	if (was_stopped) {
		power_on_blocking();
	}

	std::string version = "";

	try {
		bool smd_ready = !was_stopped || m_cmd.ping();  // Already pinged in power_on_blocking

		if (smd_ready) {
			uint8_t ver[64] = {0};
			m_cmd.read_version(ver);
			size_t len = 0;
			while (len < sizeof(ver) && ver[len] != 0 && ver[len] >= 0x20 && ver[len] < 0x7F) {
				len++;
			}
			version = std::string((char*)ver, len);
			DEBUG_INFO("SmdSat::%s: Firmware version: %s", __func__, version.c_str());
		}
	} catch (...) {
		DEBUG_ERROR("SmdSat::%s: Failed to read firmware version", __func__);
	}

	if (was_stopped) {
		m_cmd.deinit();
		shutdown();
		GPIOPins::release_sensors_pwr();
		nrf_gpio_cfg_default(BSP::GPIO_Inits[SAT_RESET].pin_number);
	}

	return version;
}

std::string SmdSat::smd_spi_test() {
	bool was_stopped = (m_state == SmdSatState::stopped);

	if (was_stopped) {
		DEBUG_INFO("SmdSat::%s: Powering on SMD for test...", __func__);
		power_on_blocking();
	}

	std::string result = m_cmd.run_command_test();

	if (was_stopped) {
		DEBUG_INFO("SmdSat::%s: Powering off SMD after test", __func__);
		m_cmd.deinit();
		shutdown();
		GPIOPins::release_sensors_pwr();
		nrf_gpio_cfg_default(BSP::GPIO_Inits[SAT_RESET].pin_number);
	}

	return result;
}
